[
  {
    "title": "Java",
    "src": "java.svg",
    "IntroHead": "Intoduction",
    "IntroDesc": "Java is one of the most popular and reliable programming languages in the world. Even after decades, it continues to power millions of applications across banking systems, enterprise software, mobile apps, and backend servers. For beginners, Java offers a strong foundation in programming concepts while also opening doors to long-term career opportunities.",
    "WhatIsHead": "What is Java",
    "WhatIsDesc": "Java is a high-level, object-oriented programming language designed to be platform-independent. This means a Java program can run on different operating systems without modification, as long as a Java runtime environment is available.",
    "HistoryHead": "History",
    "HistoryDesc": "Java was developed in 1995 with the goal of creating a language that could run on multiple devices and platforms. The first public release of Java (JDK 1.0) was on January 23, 1996, though it was first announced as an alpha in May 1995; it was developed by Sun Microsystems with James Gosling as the lead, later acquired by Oracle"
  },
  {
    "title": "JavaScript",
    "src": "javascript.svg",
    "IntroHead": "Intoduction",
    "IntroDesc": "JavaScript is one of the most important programming languages in today’s software ecosystem. It is the backbone of interactive websites and modern web applications. From simple animations on a webpage to complex full-stack applications, JavaScript plays a central role. For beginners, JavaScript is often the first language they learn because it is easy to start with and immediately rewarding. At the same time, it is powerful enough to build large-scale applications used by millions of users.",
    "WhatIsHead": "What is JavaScript",
    "WhatIsDesc": "JavaScript is a high-level, interpreted programming language primarily used to make web pages interactive. Unlike HTML, which defines structure, and CSS, which controls styling, JavaScript adds behavior to web applications. JavaScript runs directly in the browser, allowing developers to create dynamic content such as form validation, animations, live updates, and user interactions without reloading the page.",
    "HistoryHead": "History",
    "HistoryDesc": "JavaScript was created in 1995 to make web pages more dynamic. Over time, it evolved from a simple scripting language into a full-fledged programming language capable of running both in browsers and on servers. Today, JavaScript is used not only for frontend development but also for backend systems, mobile apps, desktop applications, and even game development."
  },
  {
    "title": "TypeScript",
    "src": "typescript.svg",
    "IntroHead": "Intoduction",
    "IntroDesc": "As web applications grow in size and complexity, maintaining JavaScript code becomes increasingly challenging. Bugs related to unexpected data types, unclear function contracts, and poor tooling can slow development and introduce errors.TypeScript was created to solve these problems. It builds on top of JavaScript by adding static typing, better tooling, and improved code maintainability—without removing any of JavaScript’s flexibility.",
    "WhatIsHead": "What is JavaScript",
    "WhatIsDesc": "TypeScript is a superset of JavaScript, which means Every valid JavaScript code is valid TypeScript TypeScript adds extra features on top of JavaScript TypeScript code is compiled into plain JavaScript In simple terms, TypeScript helps developers catch errors early and write more predictable code.",
    "HistoryHead": "History",
    "HistoryDesc": "JavaScript is dynamically typed, which means type-related errors often appear only at runtime. In large projects, this can lead to bugs that are difficult to track.TypeScript addresses this by: Detecting errors during development Making code easier to understand Improving collaboration in teams Scaling better for large applications."
  }
]
